       IDENTIFICATION DIVISION.
      *================================================================*
       PROGRAM-ID.       COB001.
       AUTHOR.           IVAN RIBEIRO.
      *================================================================*
       ENVIRONMENT DIVISION.
      *================================================================*
       DATA DIVISION.
      *================================================================*
       WORKING-STORAGE SECTION.
       01  CLIENTE.
           02  NOME       PIC X(20) VALUE 'IVAN RIBEIRO'.
           02  CIDADE     PIC X(20) VALUE 'BRASILIA'.
      *================================================================*
       PROCEDURE DIVISION.
      *================================================================*
           DISPLAY CLIENTE.
           STOP RUN.
