       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COB006.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  VLR01   PIC 99 VALUE 15.
       77  VLR02   PIC 99 VALUE 5.
       77  RESULT  PIC 99.
      *
       PROCEDURE DIVISION.
           SUBTRACT VLR01 FROM VLR02 GIVING RESULT.
           DISPLAY 'RESULT: ' RESULT
           STOP RUN.
